src/cf/InformationRegisters/СтатусыОтчетовОРозничныхПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОтчетовОРозничныхПродажах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьОтрицательныеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьРасхождениеПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьРасхождениеПоОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОформленАктСписанияЕГАИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/Запасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Запасы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоррСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыНаВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеВРозницуСуммовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДвижениеЧекаВОткрытойСмене</Name>
					<Comment>Для изолирования движений по оперативному проведению Чеков ККМ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыОтчетовОРозничныхПродажах/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Запускает обновление отражения отрицательных остатков по документам ОРП в служебном регистре
//
Процедура ЗапуститьОбновлениеОтраженияОтрицательныхОстатков(ДокументСсылка) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтслеживатьСтатусыОтчетовОРозничныхПродажах") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка)
		ИЛИ НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументСсылка, "Дата") Тогда
		
		Возврат;
	КонецЕсли;
	
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОРП.Ссылка КАК Ссылка,
		|	ОРП.Дата КАК Дата,
		|	ОРП.Организация КАК Организация,
		|	ОРП.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ИЗ
		|	РегистрСведений.СтатусыОтчетовОРозничныхПродажах КАК СтатусыОтчетовОРозничныхПродажах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|		ПО (СтатусыОтчетовОРозничныхПродажах.ЕстьОтрицательныеОстатки)
		|			И СтатусыОтчетовОРозничныхПродажах.ОтчетОРозничныхПродажах = ОРП.Ссылка
		|			И (ОРП.Ссылка = &ДокументСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОРП.Ссылка,
		|	ОРП.Дата,
		|	ОРП.Организация,
		|	ОРП.СтруктурнаяЕдиница
		|ИЗ
		|	РегистрСведений.СтатусыОтчетовОРозничныхПродажах КАК СтатусыОтчетовОРозничныхПродажах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|		ПО (СтатусыОтчетовОРозничныхПродажах.ЕстьОтрицательныеОстатки)
		|			И СтатусыОтчетовОРозничныхПродажах.ОтчетОРозничныхПродажах = ОРП.Ссылка
		|			И (ОРП.Дата >= &ДатаДокумента)
		|			И (ОРП.Ссылка <> &ДокументСсылка)";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отбор =Новый Структура;
		Отбор.Вставить("Ключ", "ОбновлениеОтраженияОтрицательныхОстатковОРП");
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		ФоновоеЗадание = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		Если ФоновоеЗадание.Количество() Тогда
			Возврат;
		КонецЕсли;
		
		ИмяПроцедуры = "РегистрыСведений.СтатусыОтчетовОРозничныхПродажах.ОбновитьОтражениеОтрицательныхОстатков";
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
		ПараметрыВыполнения.КлючФоновогоЗадания = "ОбновлениеОтраженияОтрицательныхОстатковОРП";
		ПараметрыВыполнения.ОжидатьЗавершение = 0;
		ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяПроцедуры, ДокументСсылка, ДатаДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет отражение отрицательных остатков по документам ОРП в служебном регистре
//
Процедура ОбновитьОтражениеОтрицательныхОстатков(ДокументСсылка, ДатаДокумента) Экспорт
	
	// Получим список ОРП  у которых больше нет отрицательных остатков
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОРП.Ссылка КАК Ссылка,
		|	ОРП.Дата КАК Дата,
		|	ОРП.Организация КАК Организация,
		|	ОРП.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ОРППроверкаОтрицательныхОстатков
		|ИЗ
		|	РегистрСведений.СтатусыОтчетовОРозничныхПродажах КАК СтатусыОтчетовОРозничныхПродажах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|		ПО (СтатусыОтчетовОРозничныхПродажах.ЕстьОтрицательныеОстатки)
		|			И СтатусыОтчетовОРозничныхПродажах.ОтчетОРозничныхПродажах = ОРП.Ссылка
		|			И (ОРП.Ссылка = &ДокументСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОРП.Ссылка,
		|	ОРП.Дата,
		|	ОРП.Организация,
		|	ОРП.СтруктурнаяЕдиница
		|ИЗ
		|	РегистрСведений.СтатусыОтчетовОРозничныхПродажах КАК СтатусыОтчетовОРозничныхПродажах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОРП
		|		ПО (СтатусыОтчетовОРозничныхПродажах.ЕстьОтрицательныеОстатки)
		|			И СтатусыОтчетовОРозничныхПродажах.ОтчетОРозничныхПродажах = ОРП.Ссылка
		|			И (ОРП.Дата >= &ДатаДокумента)
		|			И (ОРП.Ссылка <> &ДокументСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОРППроверкаОтрицательныхОстатков.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ОРПОтрицательныеОстатки
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Запасы КАК ОРПЗапасы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОРППроверкаОтрицательныхОстатков КАК ОРППроверкаОтрицательныхОстатков
		|		ПО ОРПЗапасы.Ссылка = ОРППроверкаОтрицательныхОстатков.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО (СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас))
		|			И ОРПЗапасы.Номенклатура = СпрНоменклатура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.ОстаткиИОбороты(, , Секунда, , ) КАК ЗапасыОстаткиИОбороты
		|		ПО (ОРППроверкаОтрицательныхОстатков.Дата = ЗапасыОстаткиИОбороты.Период)
		|			И (ОРППроверкаОтрицательныхОстатков.Организация = ЗапасыОстаткиИОбороты.Организация)
		|			И (ОРППроверкаОтрицательныхОстатков.СтруктурнаяЕдиница = ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница)
		|			И ОРПЗапасы.Номенклатура = ЗапасыОстаткиИОбороты.Номенклатура
		|			И ОРПЗапасы.Характеристика = ЗапасыОстаткиИОбороты.Характеристика
		|			И ОРПЗапасы.Партия = ЗапасыОстаткиИОбороты.Партия
		|			И (ЗапасыОстаткиИОбороты.КоличествоКонечныйОстаток < 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОРППроверкаОтрицательныхОстатков.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОРППроверкаОтрицательныхОстатков.Ссылка КАК Ссылка
		|ИЗ
		|	ОРППроверкаОтрицательныхОстатков КАК ОРППроверкаОтрицательныхОстатков
		|ГДЕ
		|	НЕ ОРППроверкаОтрицательныхОстатков.Ссылка В
		|				(ВЫБРАТЬ
		|					ОРПОтрицательныеОстатки.Ссылка КАК Ссылка
		|				ИЗ
		|					ОРПОтрицательныеОстатки КАК ОРПОтрицательныеОстатки)";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Установим флаг ЕстьОтрицательныеОстатки в значение ЛОЖЬ или удалим запись, если остальные флаги тоже ЛОЖЬ
		ДанныеИзменения = Новый Структура;
		ДанныеИзменения.Вставить("ЕстьОтрицательныеОстатки", Ложь);
		ОбновитьЗапись(Выборка.Ссылка, ДанныеИзменения);
		
	КонецЦикла;
	
КонецПроцедуры

// Обновляет отражение не оформленного акта списания ЕГАИС для документа ОРП в служебном регистре
//
Процедура ОбновитьОтражениеНеОформленногоАктаСписанияЕГАИС(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтслеживатьСтатусыОтчетовОРозничныхПродажах") Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ(ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АктСписанияЕГАИС")
		И ЗначениеЗаполнено(ДокументОбъект.ДокументОснование)
		И ТипЗнч(ДокументОбъект.ДокументОснование) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Установим флаг НеОформленАктСписанияЕГАИС в значение ЛОЖЬ или удалим запись, если остальные флаги тоже ЛОЖЬ
		ДанныеИзменения = Новый Структура;
		ДанныеИзменения.Вставить("НеОформленАктСписанияЕГАИС", Ложь);
		ОбновитьЗапись(ДокументОбъект.ДокументОснование, ДанныеИзменения);
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СпрНоменклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК СпрНоменклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВестиСведенияДляДекларацийПоАлкогольнойПродукции КАК ИспользуетсяЕГАИС
			|		ПО (ИспользуетсяЕГАИС.Значение)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.Запасы КАК ОРПЗапасы
			|		ПО (ОРПЗапасы.Ссылка = &ОРПСсылка)
			|			И СпрНоменклатура.Ссылка = ОРПЗапасы.Номенклатура
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
			|		ПО СпрНоменклатура.ВидАлкогольнойПродукции = ВидыАлкогольнойПродукции.Ссылка
			|			И (НЕ ВидыАлкогольнойПродукции.Маркируемый)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
			|		ПО (ОРПЗапасы.Ссылка = АктСписанияЕГАИС.ДокументОснование)
			|			И (АктСписанияЕГАИС.Проведен)
			|			И (АктСписанияЕГАИС.Ссылка <> &ДокументСсылка)
			|ГДЕ
			|	АктСписанияЕГАИС.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ОРПСсылка", ДокументОбъект.ДокументОснование);
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		// Установим флаг НеОформленАктСписанияЕГАИС в значение ИСТИНА или добавим запись, если запись уже есть
		ДанныеИзменения = Новый Структура;
		ДанныеИзменения.Вставить("НеОформленАктСписанияЕГАИС", Истина);
		ОбновитьЗапись(ДокументОбъект.ДокументОснование, ДанныеИзменения);
		
	КонецЕсли;
	
КонецПроцедуры

// Обновляет запись в служебном регистре Статусы отчетов о розничных продажах.
//
Процедура ОбновитьЗапись(ОтчетОРозничныхПродажахСсылка, ДанныеИзменения) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтслеживатьСтатусыОтчетовОРозничныхПродажах") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтчетОРозничныхПродажахСсылка)
		ИЛИ ТипЗнч(ОтчетОРозничныхПродажахСсылка) <> Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
		ИЛИ ТипЗнч(ДанныеИзменения) <> Тип("Структура") Тогда
		
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.СтатусыОтчетовОРозничныхПродажах.СоздатьМенеджерЗаписи();
	Запись.ОтчетОРозничныхПродажах = ОтчетОРозничныхПродажахСсылка;
	Запись.Прочитать();
	
	ЗаполнитьЗначенияСвойств(Запись, ДанныеИзменения);
	
	Если Запись.ЕстьОтрицательныеОстатки
		ИЛИ Запись.ЕстьРасхождениеПоТоварам
		ИЛИ Запись.ЕстьРасхождениеПоОплате
		ИЛИ Запись.НеОформленАктСписанияЕГАИС Тогда
		
		Запись.ОтчетОРозничныхПродажах = ОтчетОРозничныхПродажахСсылка;
		Запись.Записать();
	ИначеЕсли Запись.Выбран() Тогда
		Запись.Удалить();
	Иначе
		// Действие не требуется
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
